spring-ws-core/src/test/resources/org/springframework/ws/soap/addressing/10/request-no-reply-to.xml

<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="https://www.w3.org/2005/08/addressing">
    <S:Header>
        <wsa:MessageID>https://example.com/someuniquestring</wsa:MessageID>
        <wsa:To>mailto:fabrikam@example.com</wsa:To>
        <wsa:Action>http://example.com/fabrikam/mail/Delete</wsa:Action>
    </S:Header>
    <S:Body>
        <f:Delete xmlns:f="http://example.com/fabrikam">
            <maxCount>42</maxCount>
        </f:Delete>
    </S:Body>
</S:Envelope>
